Tekla Open API Reference for Tekla Structures 2025
Settings Class
 The Settings class contains the currently active unit settings.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Datatype.Settings
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Settings
Public Class Settings
The Settings type exposes the following members.
Constructors
Name | Description
Settings
Initializes a new instance of the Settings class
Top
Methods
Name | Description
GetValue
 Gets the value of the setting with the given name.
SetValue
 Sets a setting to a value.
TryGetValue(String, Object)
 Tries to get the value of the setting with the given name.
TryGetValue<T>(String, T)
 Tries to get the value of the setting with the given name and given object type.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace